DataProcessors/ТестСебестоимость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ТестСебестоимость</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реестр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Покупка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гашение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДанныеДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ДанныеДоговоров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущийОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегоЗадолженность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныйОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Неустойка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРасчетаЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Платежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>Платежи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вознаграждение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтметкаФССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реестр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реестр</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/ТестСебестоимость/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	// Вставить содержимое обработчика.
	
	СформироватьНаСервере(Объект.НачалоПериода,Объект.КонецПериода);
	
	
	
	ЗапИтогТаблицу();
	  
	
	
	
	Сообщить("Ок");
	
КонецПроцедуры


&НаСервере
Процедура ЗапИтогТаблицу()

	    
	       ТЗ= Объект.ТЧ.выгрузить();
	
	   	//Подсчитаю итоги
		
	     СуммаВсегоДолгИтог=0;
		 СуммаПокупкаИтог=0;
		 СуммаГашенияИтог=0;
       
    	 Запрос = Новый Запрос;
        
    	 Запрос.УстановитьПараметр("ТаблицаДанных", ТЗ);

    	 	 Запрос.Текст ="ВЫБРАТЬ
                           |    *
                           |ПОМЕСТИТЬ ВТ_Данные
                           |ИЗ
                           |    &ТаблицаДанных КАК ТЧ;
    		               |ВЫБРАТЬ  
    					   |  ВТ_Данные.Реестр КАК Реестр,
    					   |  Сумма(Себестоимость) КАК СуммаСебестоимости,
    					   |  Сумма(ВсегоДолг)  Как СуммаВсегоДолг,
    					   |  Сумма(Покупка) Как СуммаПокупка,
    					   |  Сумма(Гашение) Как СуммаГашение
    					   |ИЗ ВТ_Данные
    					   |СГРУППИРОВАТЬ ПО
                    	   |	Реестр
                           |	";
    		 
        		 
 
          РезультатЗапроса = Запрос.Выполнить();
    			
          ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    			
    			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
    				
					Стр=ТабИтог.Добавить();
					Стр.Реестр=ВыборкаДетальныеЗаписи.Реестр;
					Стр.ВсегоДолг=ВыборкаДетальныеЗаписи.СуммаВсегоДолг;
					СуммаВсегоДолгИтог=СуммаВсегоДолгИтог+ВыборкаДетальныеЗаписи.СуммаВсегоДолг;
					
					Стр.Себестоимость=ВыборкаДетальныеЗаписи.СуммаСебестоимости;
					
					
					Если ВыборкаДетальныеЗаписи.СуммаВсегоДолг<>0 И ВыборкаДетальныеЗаписи.СуммаГашение<>0 Тогда
					
						 Стр.СебестоимостьРасчет=ВыборкаДетальныеЗаписи.СуммаПокупка/ВыборкаДетальныеЗаписи.СуммаВсегоДолг*ВыборкаДетальныеЗаписи.СуммаГашение;  
					
					Иначе
					    Стр.СебестоимостьРасчет=0;
						
					
					КонецЕсли;
					
					
					
					Стр.Покупка=ВыборкаДетальныеЗаписи.СуммаПокупка;
					СуммаПокупкаИтог=СуммаПокупкаИтог+ВыборкаДетальныеЗаписи.СуммаПокупка;
					
					
					
					Стр.Гашение=ВыборкаДетальныеЗаписи.СуммаГашение;
					СуммаГашенияИтог=СуммаГашенияИтог+ВыборкаДетальныеЗаписи.СуммаГашение;

    			КонецЦикла;
    			
    			
				
	// Добавить строку итого
	             Стр=ТабИтог.Добавить();
	             Стр.Реестр="Итого: ";
				 Стр.ВсегоДолг=СуммаВсегоДолгИтог;
				 Стр.Покупка=СуммаПокупкаИтог;
				 Стр.Гашение=СуммаГашенияИтог;
	            
				

	

КонецПроцедуры





&НаСервере
Процедура СформироватьНаСервере(НачалоПериода,КонецПериода)

	 Объект.ТЧ.Очистить();
	 ТабИтог.Очистить();
	  

	      	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеестрДолжники.Должник КАК Должник,
		|	РеестрДолжники.Договор КАК Договор
		|ИЗ
		|	Документ.Реестр.Должники КАК РеестрДолжники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДоговоров.СрезПоследних КАК ДанныеДоговоровСрезПоследних
		|		ПО РеестрДолжники.Договор = ДанныеДоговоровСрезПоследних.Договор
		|			И РеестрДолжники.Должник = ДанныеДоговоровСрезПоследних.Договор.Владелец";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	 
	 
	 
	  Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Реестр.НомерДляПечати КАК НомерДляПечати,
		|	Реестр.ДатаНачалаУчета КАК ДатаНачалаУчета,
		|	Реестр.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Реестр
		|ИЗ
		|	Документ.Реестр КАК Реестр
		|ГДЕ
		|	(Реестр.ДатаНачалаУчета МЕЖДУ &ДатаНачала И &ДатаКонец) ИЛИ Реестр.ДатаОкончанияУчета>&ДатаКонец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеестрДолжники.Должник КАК Должник,
		|	РеестрДолжники.Договор КАК Договор,
		|	РеестрДолжники.ВсегоЗадолженность КАК ВсегоЗадолженность,
		|	РеестрДолжники.Ссылка КАК Ссылка,
		|	ДанныеДоговоровСрезПоследних.ВсегоЗадолженность КАК ВсегоЗадолженность1
		|ПОМЕСТИТЬ ТЧ
		|ИЗ
		|	Документ.Реестр.Должники КАК РеестрДолжники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДоговоров.СрезПоследних(&МоментВремени, ) КАК ДанныеДоговоровСрезПоследних
		|		ПО РеестрДолжники.Договор = ДанныеДоговоровСрезПоследних.Договор
		|         И РеестрДолжники.Должник = ДанныеДоговоровСрезПоследних.Договор.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Реестр.НомерДляПечати КАК НомерДляПечати,
		|	Реестр.ДатаНачалаУчета КАК ДатаНачалаУчета,
		|	Реестр.Ссылка КАК СсылкаРеестр,
		|	ТЧ.Должник КАК Должник,
		|	ТЧ.Договор КАК Договор,
		|	ТЧ.ВсегоЗадолженность КАК ВсегоЗадолженность,
		|	ТЧ.Договор.ПроцентПокупки КАК ДоговорПроцентПокупки,
		|	ТЧ.ВсегоЗадолженность1 * ТЧ.Договор.ПроцентПокупки / 100 КАК ЦенаПокупки,
		|	ТЧ.Договор.СуммаКредита КАК ДоговорСуммаКредита,
		|	ТЧ.ВсегоЗадолженность1 КАК ВсегоЗадолженность1
		|ИЗ
		|	Реестр КАК Реестр
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЧ КАК ТЧ
		|		ПО Реестр.Ссылка = ТЧ.Ссылка";

	
	
	
		
	Запрос.УстановитьПараметр("ДатаКонец", КонецПериода);
	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоПериода);
	Запрос.УстановитьПараметр("МоментВремени", КонецПериода);


	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 Сумма=0;
		// Пройтись по платежам
		
		//  Зря ходил по платежам - надо по регистру Платежи
		
		
				
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	Платежи.Сумма,
						|	Платежи.Реестр,
						|	Платежи.Должник,
						|	Платежи.Договор
						|ИЗ
						|	РегистрНакопления.Платежи КАК Платежи
						|ГДЕ
						|	Платежи.Реестр = &СсылкаРеестр
						|	И Платежи.Должник = &Должник
						|	И Платежи.Договор = &Договор";
					
					Запрос.УстановитьПараметр("Договор", Выборка.Договор);
					Запрос.УстановитьПараметр("Должник", Выборка.Должник);
					Запрос.УстановитьПараметр("СсылкаРеестр",Выборка.СсылкаРеестр);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
						  Сумма=Сумма+ВыборкаДетальныеЗаписи.Сумма;
						
					КонецЦикла;
					
			      
		
		           
			Если Выборка.ВсегоЗадолженность1<>0 И Выборка.ЦенаПокупки<>Null И Выборка.ВсегоЗадолженность1>0  Тогда
				
				Попытка
				      

					  СтартП= Окр(Выборка.ДоговорПроцентПокупки*Сумма/100,2);

					 //СтартП= Окр((Выборка.ЦенаПокупки/Выборка.ВсегоЗадолженность1*100)*Сумма/100,2);
				
				Исключение
					
					Сообщить(Выборка.Должник);
					СтартП=0;
					
					
				КонецПопытки;
				  
				 
			
			Иначе
			
				 СтартП=0;
			
			КонецЕсли;	 
					
					
   		     

			
				
			Запись=Объект.ТЧ.Добавить();
			Запись.Реестр=Выборка.НомерДляПечати;
			Запись.Должник=Выборка.Должник;
			Запись.Договор=Выборка.Договор;
			Запись.ВсегоДолг=Окр(Выборка.ВсегоЗадолженность1,2);
			
			 Если Выборка.ЦенаПокупки<>Null Тогда
			 
			 	  Запись.Покупка=Окр(Выборка.ЦенаПокупки,2);
			 
			 КонецЕсли;
			
			 
			
			Запись.Гашение=Сумма;
			Запись.Себестоимость= СтартП;
				
				
			
	
			
			
			
			
			
			
			
		
		
	КонецЦикла;
	
	
		//Подсчитаю итоги
		
	 
	
	

	 
	 
	
	
	
	
	

КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере()
	
	ТабДокумент=Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб=Истина;
	ТабДокумент.ТолькоПросмотр=Истина;

	
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	
    Макет =  ОтчетОбъект.ПолучитьМакет("Макет"); 
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	
	 	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	
	
    ТабДокумент.Вывести(ОбластьШапка);
	
	Для каждого Стр  Из ТабИтог  Цикл
		
		ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
		
		ОбластьСтрока.Параметры.Реестр=Стр.Реестр;
		
		ОбластьСтрока.Параметры.Себестоимость=Стр.Себестоимость;
		ОбластьСтрока.Параметры.СуммаДолга=Стр.ВсегоДолг;
		ОбластьСтрока.Параметры.Покупка=Стр.Покупка;
		ОбластьСтрока.Параметры.Гашения=Стр.Гашение;
		ОбластьСтрока.Параметры.СебестРасчет=Стр.СебестоимостьРасчет;
		
		 ТабДокумент.Вывести(ОбластьСтрока);
	
	КонецЦикла;
	
	
	

	

    Возврат  ТабДокумент;
    
КонецФункции


&НаКлиенте
Процедура Печать(Команда)
	// Вставить содержимое обработчика.
	
	    ТабДокумент= ПолучитьМакетНаСервере();
	
       ТабДокумент.Показать("Себестоимость");
	
КонецПроцедуры


&НаСервере
Функция ПолучитьМакетСформироватьНаСервере()
	
	ТабДокумент=Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб=Истина;
	ТабДокумент.ТолькоПросмотр=Истина;

	
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	
    Макет =  ОтчетОбъект.ПолучитьМакет("МакетСформировать"); 
	
	//ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	
  	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	
	
    ТабДокумент.Вывести(ОбластьШапка);

	
		Для каждого Стр  Из Объект.ТЧ  Цикл
		
		ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
		
		ОбластьСтрока.Параметры.реестр=Стр.Реестр;
		
		ОбластьСтрока.Параметры.себестоимость=Стр.Себестоимость;
		
		ОбластьСтрока.Параметры.должник=Стр.Должник;
		ОбластьСтрока.Параметры.договор=Стр.Договор;
		
		ОбластьСтрока.Параметры.всегоДолг=Стр.ВсегоДолг;
		
		ОбластьСтрока.Параметры.покупка=Стр.Покупка;
		
		ОбластьСтрока.Параметры.гашение=Стр.Гашение;
		
		
		
		 ТабДокумент.Вывести(ОбластьСтрока);
	
	КонецЦикла;
	
	
	

	

    Возврат  ТабДокумент;

	
	
	
	
КонецФункции


&НаКлиенте
Процедура ПечатьСформировать(Команда)
	
	  ТабДокумент= ПолучитьМакетСформироватьНаСервере();
	
      ТабДокумент.Показать("Себестоимость");

	
	
КонецПроцедуры
